#### Terraform Plan 🖌 🤖 ⚙️ 📖  `success`

<details><summary>Show Plan</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.product_a.data.azurerm_public_ip.aks_public_ip[0] will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_public_ip" "aks_public_ip" {
      + allocation_method       = (known after apply)
      + ddos_protection_mode    = (known after apply)
      + ddos_protection_plan_id = (known after apply)
      + domain_name_label       = (known after apply)
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = (known after apply)
      + ip_address              = (known after apply)
      + ip_tags                 = (known after apply)
      + ip_version              = (known after apply)
      + location                = (known after apply)
      + name                    = (known after apply)
      + resource_group_name     = (known after apply)
      + reverse_fqdn            = (known after apply)
      + sku                     = (known after apply)
      + tags                    = (known after apply)
      + zones                   = (known after apply)
    }

  # module.product_a.azurerm_key_vault_secret.key_vault[0] will be created
  + resource "azurerm_key_vault_secret" "key_vault" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "apfs-product2-fulano-prd"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.product_a.random_password.postgresql_administrator_password[0] will be created
  + resource "random_password" "postgresql_administrator_password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.product_a.module.create_aks[0].azurerm_kubernetes_cluster.aks_cluster will be created
  + resource "azurerm_kubernetes_cluster" "aks_cluster" {
      + api_server_authorized_ip_ranges     = (known after apply)
      + azure_policy_enabled                = false
      + dns_prefix                          = "aks-product2-fulano-prd"
      + fqdn                                = (known after apply)
      + http_application_routing_enabled    = false
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + image_cleaner_enabled               = false
      + image_cleaner_interval_hours        = 48
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = (known after apply)
      + location                            = "westeurope"
      + name                                = "aks-product2-fulano-prd"
      + node_resource_group                 = (known after apply)
      + node_resource_group_id              = (known after apply)
      + oidc_issuer_enabled                 = false
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = false
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + public_network_access_enabled       = true
      + resource_group_name                 = "product2-fulano-prd"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Standard"
      + workload_identity_enabled           = false

      + default_node_pool {
          + enable_auto_scaling   = true
          + enable_node_public_ip = true
          + kubelet_disk_type     = (known after apply)
          + max_count             = 3
          + max_pods              = (known after apply)
          + min_count             = 1
          + name                  = "nodepool"
          + node_count            = (known after apply)
          + node_labels           = (known after apply)
          + orchestrator_version  = (known after apply)
          + os_disk_size_gb       = 128
          + os_disk_type          = "Managed"
          + os_sku                = (known after apply)
          + scale_down_mode       = "Delete"
          + type                  = "VirtualMachineScaleSets"
          + ultra_ssd_enabled     = false
          + vm_size               = "Standard_D2s_v3"
          + workload_runtime      = (known after apply)
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + key_vault_secrets_provider {
          + secret_identity          = (known after apply)
          + secret_rotation_enabled  = true
          + secret_rotation_interval = "2m"
        }

      + network_profile {
          + dns_service_ip     = (known after apply)
          + docker_bridge_cidr = (known after apply)
          + ip_versions        = (known after apply)
          + load_balancer_sku  = "standard"
          + network_mode       = (known after apply)
          + network_plugin     = "kubenet"
          + network_policy     = (known after apply)
          + outbound_type      = "loadBalancer"
          + pod_cidr           = (known after apply)
          + pod_cidrs          = (known after apply)
          + service_cidr       = (known after apply)
          + service_cidrs      = (known after apply)
        }
    }

  # module.product_a.module.create_key_vault[0].azurerm_key_vault.main will be created
  + resource "azurerm_key_vault" "main" {
      + access_policy                   = [
          + {
              + certificate_permissions = [
                  + "Backup",
                  + "Create",
                  + "Delete",
                  + "DeleteIssuers",
                  + "Get",
                  + "GetIssuers",
                  + "Import",
                  + "List",
                  + "ListIssuers",
                  + "ManageContacts",
                  + "ManageIssuers",
                  + "Purge",
                  + "Recover",
                  + "Restore",
                  + "SetIssuers",
                  + "Update",
                ]
              + key_permissions         = [
                  + "Create",
                  + "Delete",
                  + "Get",
                  + "Backup",
                  + "Decrypt",
                  + "Encrypt",
                  + "Import",
                  + "List",
                  + "Purge",
                  + "Recover",
                  + "Restore",
                  + "Sign",
                  + "Update",
                  + "Verify",
                ]
              + object_id               = "e5a7c1f0-f607-423c-b513-f6cc3588a122"
              + secret_permissions      = [
                  + "Backup",
                  + "Delete",
                  + "Get",
                  + "List",
                  + "Purge",
                  + "Recover",
                  + "Restore",
                  + "Set",
                ]
              + storage_permissions     = [
                  + "Backup",
                  + "Delete",
                  + "DeleteSAS",
                  + "Get",
                  + "GetSAS",
                  + "List",
                  + "ListSAS",
                  + "Purge",
                  + "Recover",
                  + "RegenerateKey",
                  + "Restore",
                  + "Set",
                  + "SetSAS",
                  + "Update",
                ]
              + tenant_id               = "ff0bb63a-9a7a-46de-aaea-b37b993f4a8e"
            },
        ]
      + enable_rbac_authorization       = false
      + enabled_for_deployment          = true
      + enabled_for_disk_encryption     = true
      + enabled_for_template_deployment = true
      + id                              = (known after apply)
      + location                        = "westeurope"
      + name                            = "akv-product2-fulano-prd"
      + public_network_access_enabled   = true
      + purge_protection_enabled        = false
      + resource_group_name             = "product2-fulano-prd"
      + sku_name                        = "standard"
      + soft_delete_retention_days      = 90
      + tags                            = {
          + "ResourceName" = "akv-product2-fulano-prd"
          + "client"       = "fulano"
          + "product"      = "product2"
        }
      + tenant_id                       = "ff0bb63a-9a7a-46de-aaea-b37b993f4a8e"
      + vault_uri                       = (known after apply)
    }

  # module.product_a.module.create_postgresql[0].azurerm_postgresql_flexible_server.postgresql_flexible_server will be created
  + resource "azurerm_postgresql_flexible_server" "postgresql_flexible_server" {
      + administrator_login           = "postgres"
      + administrator_password        = (sensitive value)
      + backup_retention_days         = 7
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = false
      + id                            = (known after apply)
      + location                      = "westeurope"
      + name                          = "apfs-product2-fulano-prd"
      + private_dns_zone_id           = (known after apply)
      + public_network_access_enabled = (known after apply)
      + resource_group_name           = "product2-fulano-prd"
      + sku_name                      = "GP_Standard_D2ds_v4"
      + storage_mb                    = 32768
      + tags                          = {
          + "client"  = "fulano"
          + "product" = "product2"
        }
      + version                       = "14"
    }

  # module.product_a.module.create_postgresql[0].azurerm_postgresql_flexible_server_database.postgresql_flexible_db["backend"] will be created
  + resource "azurerm_postgresql_flexible_server_database" "postgresql_flexible_db" {
      + charset   = "UTF8"
      + collation = "en_US.UTF8"
      + id        = (known after apply)
      + name      = "backend"
      + server_id = (known after apply)
    }

  # module.product_a.module.create_postgresql[0].azurerm_postgresql_flexible_server_database.postgresql_flexible_db["hasura"] will be created
  + resource "azurerm_postgresql_flexible_server_database" "postgresql_flexible_db" {
      + charset   = "UTF8"
      + collation = "en_US.UTF8"
      + id        = (known after apply)
      + name      = "hasura"
      + server_id = (known after apply)
    }

  # module.product_a.module.create_postgresql[0].azurerm_postgresql_flexible_server_firewall_rule.firewall_rules["User1"] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "firewall_rules" {
      + end_ip_address   = "10.10.119.12"
      + id               = (known after apply)
      + name             = "User1"
      + server_id        = (known after apply)
      + start_ip_address = "10.10.119.12"
    }

  # module.product_a.module.create_postgresql[0].azurerm_postgresql_flexible_server_firewall_rule.firewall_rules["User2"] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "firewall_rules" {
      + end_ip_address   = "10.10.101.58"
      + id               = (known after apply)
      + name             = "User2"
      + server_id        = (known after apply)
      + start_ip_address = "10.10.101.58"
    }

  # module.product_a.module.create_postgresql[0].azurerm_postgresql_flexible_server_firewall_rule.firewall_rules["aks-product2-fulano-prd"] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "firewall_rules" {
      + end_ip_address   = (known after apply)
      + id               = (known after apply)
      + name             = "aks-product2-fulano-prd"
      + server_id        = (known after apply)
      + start_ip_address = (known after apply)
    }

  # module.product_a.module.kured[0].helm_release.kured[0] will be created
  + resource "helm_release" "kured" {
      + atomic                     = false
      + chart                      = "kured"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "kured"
      + namespace                  = "kured"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubereboot.github.io/charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "4.5.1"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "image.pullPolicy"
          + value = "IfNotPresent"
        }
      + set {
          + name  = "image.repository"
          + value = "ghcr.io/kubereboot/kured"
        }
    }

Plan: 11 to add, 0 to change, 0 to destroy.
```

</details>

*Pusher: @nelsonrp24*